src/Catalogs/ИС_Ozon_Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ozon_Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_rfbs</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_kgt</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_СтатусыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзЛК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиИзГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСхемуFBO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьОрдерНаОтгрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокиРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскоеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОсновнойСкладВЗаказах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладДляЗаказовФБО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаправленияДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_Ozon_Склады/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура АвтоматическиСоздаватьОрдерНаОтгрузкуПриИзменении(Элемент)
	УстановитьВидимостьОрдернойСхемы();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураПараметров = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки();
	СтруктураПараметров.ИмяРеквизитаАдресаДоставки 				= "АдресДоставки";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначенияПолей = "АдресДоставкиЗначенияПолей";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначение 		= "АдресДоставкиЗначение";  
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		СтруктураПараметров,
		СтандартнаяОбработка);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей,
		Объект.АдресДоставкиЗначение);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127 

//+ ИнфоСофт Заварин К.В. 30.01.25 УА #88005
&НаКлиенте
Процедура ВыгружатьОстаткиИзГруппыСкладовПриИзменении(Элемент)
	УстановитьОформление();		
КонецПроцедуры //- ИнфоСофт Заварин К.В. 30.01.25 УА #88005

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
&НаКлиенте
Процедура СкладДляЗаказовФБОПриИзменении(Элемент)
	
	Если Объект.СкладДляЗаказовФБО Тогда 
		
		Объект.ИспользоватьСхемуFBO = Ложь;
		Объект.is_kgt = Ложь;
		Объект.is_rfbs = Ложь;
		
		Элементы.ИспользоватьСхемуFBO.Доступность = Ложь;
		Элементы.is_kgt.Доступность = Ложь;
		Элементы.is_rfbs.Доступность = Ложь;
		
	Иначе
		
		Объект.ИспользоватьСхемуFBO = Истина;
		Объект.is_kgt = Истина;
		Объект.is_rfbs = Истина;
		
		Элементы.ИспользоватьСхемуFBO.Доступность = Истина;
		Элементы.is_kgt.Доступность = Истина;
		Элементы.is_rfbs.Доступность = Истина;
		
	КонецЕсли;  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СкладДляЗаказовФБО Тогда
		Объект.ИспользоватьСхемуFBO = Ложь;
		Объект.is_kgt = Ложь;
		Объект.is_rfbs = Ложь;		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672
&НаКлиенте
Процедура СкладскоеПомещениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПомещение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина); 
	
	ОткрытьФорму("Справочник.СкладскиеПомещения.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеВыбора);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672

//+ ИнфоСофт Стояк Ю.К. 17.04.2025 УА #99271
&НаКлиенте
Процедура ОбщаяГруппаСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 17.04.2025 УА #99271

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура УстановитьОформление()
	УстановитьВидимостьОрдернойСхемы();
	
	//+ ИнфоСофт Стояк Ю.К. 17.04.2025 УА #99271	
	Если ЗначениеЗаполнено(Объект.ОбщаяГруппаСкладов) Тогда
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Ложь;
		Элементы.ГруппаСкладов.Видимость = Ложь;	
		Объект.ВыгружатьОстаткиИзГруппыСкладов = Ложь;		
	Иначе
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Объект.ВыгружатьОстаткиИзГруппыСкладов;	
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 17.04.2025 УА #99271
	
	//+ ИнфоСофт Заварин К.В. 30.01.25 УА #88005
	Если Объект.ВыгружатьОстаткиИзГруппыСкладов Тогда
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Истина;	
	Иначе
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Ложь;
		Объект.ИспользоватьОсновнойСкладВЗаказах 			 = Ложь;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005 
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Объект.СкладДляЗаказовФБО Тогда
		Элементы.ИспользоватьСхемуFBO.Доступность = Ложь;
		Элементы.is_kgt.Доступность = Ложь;
		Элементы.is_rfbs.Доступность = Ложь;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура УстановитьВидимостьОрдернойСхемы()

	Элементы.СкладскоеПомещение.Видимость 			= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусРасходногоОрдера.Видимость 		= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусСтрокиРасходногоОрдера.Видимость = Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672
&НаКлиенте
Процедура ОбработатьВыборПомещение(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СкладскоеПомещение =  РезультатЗакрытия;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672

#КонецОбласти
